HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCcu6_regdef.h
/** \\brief  Port Input Select Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_PISEL2_Bits B;
} Ifx_CCU6_PISEL2;

/** \\brief  Passive State Level Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_PSLR_Bits B;
} Ifx_CCU6_PSLR;

/** \\brief  Timer T12 Counter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_T12_Bits B;
} Ifx_CCU6_T12;

/** \\brief  Dead-Time Control Register for Timer12 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_T12DTC_Bits B;
} Ifx_CCU6_T12DTC;

/** \\brief  T12 Mode Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_T12MSEL_Bits B;
} Ifx_CCU6_T12MSEL;

/** \\brief  Timer 12 Period Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_T12PR_Bits B;
} Ifx_CCU6_T12PR;

/** \\brief  Timer T13 Counter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_T13_Bits B;
} Ifx_CCU6_T13;

/** \\brief  Timer 13 Period Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_T13PR_Bits B;
} Ifx_CCU6_T13PR;

/** \\brief  Timer Control Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_TCTR0_Bits B;
} Ifx_CCU6_TCTR0;

/** \\brief  Timer Control Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_TCTR2_Bits B;
} Ifx_CCU6_TCTR2;

/** \\brief  Timer Control Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_TCTR4_Bits B;
} Ifx_CCU6_TCTR4;

/** \\brief  Trap Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CCU6_TRPCTR_Bits B;
} Ifx_CCU6_TRPCTR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ccu6_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  CCU6 object */
typedef volatile struct _Ifx_CCU6
{
    Ifx_CCU6_CLC CLC;                       /**< \brief 0, Clock Control Register */
    Ifx_CCU6_MCFG MCFG;                     /**< \brief 4, Module Configuration Register */
    Ifx_CCU6_ID ID;                         /**< \brief 8, Module Identification Register */
    Ifx_CCU6_MOSEL MOSEL;                   /**< \brief C, CCU60 Module Output Select Register */
    Ifx_CCU6_PISEL0 PISEL0;                 /**< \brief 10, Port Input Select Register 0 */
    Ifx_CCU6_PISEL2 PISEL2;                 /**< \brief 14, Port Input Select Register 2 */
    unsigned char reserved_18[4];           /**< \brief 18, \internal Reserved */
    Ifx_CCU6_KSCSR KSCSR;                   /**< \brief 1C, Kernel State Control Sensitivity Register */
    Ifx_CCU6_T12 T12;                       /**< \brief 20, Timer T12 Counter Register */
    Ifx_CCU6_T12PR T12PR;                   /**< \brief 24, Timer 12 Period Register */
    Ifx_CCU6_T12DTC T12DTC;                 /**< \brief 28, Dead-Time Control Register for Timer12 */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
    Ifx_CCU6_CC60R CC60R;                   /**< \brief 30, Capture/Compare Register for Channel CC60 */
    Ifx_CCU6_CC61R CC61R;                   /**< \brief 34, Capture/Compare Register for Channel CC61 */
    Ifx_CCU6_CC62R CC62R;                   /**< \brief 38, Capture/Compare Register for Channel CC62 */
    unsigned char reserved_3C[4];           /**< \brief 3C, \internal Reserved */
    Ifx_CCU6_CC60SR CC60SR;                 /**< \brief 40, Capture/Compare Shadow Reg. for Channel CC60 */
    Ifx_CCU6_CC61SR CC61SR;                 /**< \brief 44, Capture/Compare Shadow Reg. for Channel CC61 */
    Ifx_CCU6_CC62SR CC62SR;                 /**< \brief 48, Capture/Compare Shadow Reg. for Channel CC62 */
    unsigned char reserved_4C[4];           /**< \brief 4C, \internal Reserved */
    Ifx_CCU6_T13 T13;                       /**< \brief 50, Timer T13 Counter Register */
    Ifx_CCU6_T13PR T13PR;                   /**< \brief 54, Timer 13 Period Register */
    Ifx_CCU6_CC63R CC63R;                   /**< \brief 58, Compare Register for T13 */
    Ifx_CCU6_CC63SR CC63SR;                 /**< \brief 5C, Compare Shadow Register for T13 */
    Ifx_CCU6_CMPSTAT CMPSTAT;               /**< \brief 60, Compare State Register */
    Ifx_CCU6_CMPMODIF CMPMODIF;             /**< \brief 64, Compare State Modification Register */
    Ifx_CCU6_T12MSEL T12MSEL;               /**< \brief 68, T12 Mode Select Register */
    unsigned char reserved_6C[4];           /**< \brief 6C, \internal Reserved */
    Ifx_CCU6_TCTR0 TCTR0;                   /**< \brief 70, Timer Control Register 0 */
    Ifx_CCU6_TCTR2 TCTR2;                   /**< \brief 74, Timer Control Register 2 */
    Ifx_CCU6_TCTR4 TCTR4;                   /**< \brief 78, Timer Control Register 4 */
    unsigned char reserved_7C[4];           /**< \brief 7C, \internal Reserved */
    Ifx_CCU6_MODCTR MODCTR;                 /**< \brief 80, Modulation Control Register */
    Ifx_CCU6_TRPCTR TRPCTR;                 /**< \brief 84, Trap Control Register */
    Ifx_CCU6_PSLR PSLR;                     /**< \brief 88, Passive State Level Register */
    Ifx_CCU6_MCMOUTS MCMOUTS;               /**< \brief 8C, Multi-Channel Mode Output Shadow Register */
    Ifx_CCU6_MCMOUT MCMOUT;                 /**< \brief 90, Multi-Channel Mode Output Register */
    Ifx_CCU6_MCMCTR MCMCTR;                 /**< \brief 94, Multi-Channel Mode Control Register */
    Ifx_CCU6_IMON IMON;                     /**< \brief 98, Input Monitoring Register */
    Ifx_CCU6_LI LI;                         /**< \brief 9C, Lost Indicator Register */
    Ifx_CCU6_IS IS;                         /**< \brief A0, Interrupt Status Register */
    Ifx_CCU6_ISS ISS;                       /**< \brief A4, Interrupt Status Set Register */
    Ifx_CCU6_ISR ISR;                       /**< \brief A8, Interrupt Status Reset Register */
    Ifx_CCU6_INP INP;                       /**< \brief AC, Interrupt Node Pointer Register */
    Ifx_CCU6_IEN IEN;                       /**< \brief B0, Interrupt Enable Register */
    unsigned char reserved_B4[52];          /**< \brief B4, \internal Reserved */
    Ifx_CCU6_OCS OCS;                       /**< \brief E8, OCDS Control and Status Register */
    Ifx_CCU6_KRSTCLR KRSTCLR;               /**< \brief EC, Kernel Reset Status Clear Register */
    Ifx_CCU6_KRST1 KRST1;                   /**< \brief F0, Kernel Reset Register 1 */
    Ifx_CCU6_KRST0 KRST0;                   /**< \brief F4, Kernel Reset Register 0 */
    Ifx_CCU6_ACCEN1 ACCEN1;                 /**< \brief F8, Access Enable Register 1 */
    Ifx_CCU6_ACCEN0 ACCEN0;                 /**< \brief FC, Access Enable Register 0 */
} Ifx_CCU6;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCCU6_REGDEF_H */
